Revit 2026 API

# ParameterTypeIdEnergyAnalysisHvacSystem Property

---

"HVAC System"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisHvacSystem { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisHvacSystem As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisHvacSystem {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisHvacSystem : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace